Also seeing this with `cloudflare_pages_project`:

Sample output from `terraform apply`, despite no changes either in `tf`, or the resource on Cloudflare:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

# cloudflare_pages_project.[REDACTED] will be updated in-place
~ resource "cloudflare_pages_project" "[REDACTED]" {
    ~ canonical_deployment = {
        ~ build_config       = {
            + web_analytics_tag   = (known after apply)
            + web_analytics_token = (sensitive value)
            # (4 unchanged attributes hidden)
        }
        id                 = "[REDACTED]"
        ~ source             = {
            ~ config = {
                + deployments_enabled            = (known after apply)
                + path_excludes                  = (known after apply)
                + path_includes                  = (known after apply)
                + preview_branch_excludes        = (known after apply)
                + preview_branch_includes        = (known after apply)
                + preview_deployment_setting     = (known after apply)
                + production_deployments_enabled = (known after apply)
                # (4 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (13 unchanged attributes hidden)
    }
    ~ created_on           = "2024-07-05T17:33:47Z" -> (known after apply)
    ~ deployment_configs   = {
        ~ preview    = {
            ~ env_vars            = {
                ~ "NOTION_API_KEY" = {
                    + value = (sensitive value)
                    # (1 unchanged attribute hidden)
                },
                # (4 unchanged elements hidden)
            }
            # (3 unchanged attributes hidden)
        }
        ~ production = {
            ~ env_vars            = {
                ~ "NOTION_API_KEY" = {
                    + value = (sensitive value)
                    # (1 unchanged attribute hidden)
                },
                # (4 unchanged elements hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }
    ~ domains              = [
        - "[REDACTED]",
        - "[REDACTED]",
        - "[REDACTED]",
    ] -> (known after apply)
    id                   = "[REDACTED]"
    ~ latest_deployment    = {
        ~ build_config       = {
            + web_analytics_tag   = (known after apply)
            + web_analytics_token = (sensitive value)
            # (4 unchanged attributes hidden)
        }
        id                 = "[REDACTED]"
        ~ source             = {
            ~ config = {
                + deployments_enabled            = (known after apply)
                + path_excludes                  = (known after apply)
                + path_includes                  = (known after apply)
                + preview_branch_excludes        = (known after apply)
                + preview_branch_includes        = (known after apply)
                + preview_deployment_setting     = (known after apply)
                + production_deployments_enabled = (known after apply)
                # (4 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (13 unchanged attributes hidden)
    }
    name                 = "[REDACTED]"
    ~ subdomain            = "[REDACTED]" -> (known after apply)
    # (4 unchanged attributes hidden)
}
```